СЦ_Мобильное/src/Documents/ПриемДанныхСоСканера/ПриемДанныхСоСканера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемДанныхСоСканера</name>
  <attributes>
    <name>ТипСбораДанных</name>
    <type>
      <types>EnumRef.ТипСбораДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.ИнтернетМагазины</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВозврата</name>
    <type>
      <types>CatalogRef.СкладыВозврата</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>CatalogRef.СлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДляЗаполнения</name>
    <type>
      <types>CatalogRef.СтатусыОтправлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗаполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьБезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗагрузки</name>
    <type>
      <types>CatalogRef.СтатусыЗагрузкиДанныхВОсновноеПриложение</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПолученияДанных</name>
    <type>
      <types>EnumRef.РежимПолученияОжидаемыхЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗабораСЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдаленнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <type>
        <types>CatalogRef.Отправления</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеПоСтатусу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВНаличии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вычерк</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленнаяПриемка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НенайденныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СЦ_Мобильное/src/Enums/РежимПолученияОжидаемыхЗаказов/РежимПолученияОжидаемыхЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимПолученияОжидаемыхЗаказов</name>
  <enumValues>
    <name>ПоМагазину</name>
  </enumValues>
  <enumValues>
    <name>ПоРеестру</name>
  </enumValues>
  <enumValues>
    <name>ПоЗабору</name>
  </enumValues>
</mdclass:Enum>

СЦ_Мобильное/src/Catalogs/СерверыДанных/СерверыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыДанных</name>
  <predefined>
    <items>
      <name>Сервер1</name>
      <description>Сервер 1</description>
    </items>
    <items>
      <name>Сервер2</name>
      <description>Сервер 2</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресWSDLтест</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СЦ_Мобильное/src/Documents/ПриемДанныхСоСканера/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Константы.ИдентификаторМобильногоУстройства.Получить()) Тогда
		Г = Новый УникальныйИдентификатор;
		Константы.ИдентификаторМобильногоУстройства.Установить(Строка(Г));
	КонецеСли;	
	
	Если Не ЗначениеЗаполнено(Константы.ПарольАдминистратора.Получить()) Тогда
		Константы.ПарольАдминистратора.Установить("887711");
	КонецеСли;	
	
	
	Если Не ЗначениеЗаполнено(Константы.УзелПланаОбмена.Получить()) Тогда
		ЭУ = ПланыОбмена.ИзмененныеОбъекты.ЭтотУзел().ПолучитьОбъект();
		ЭУ.Наименование = "МУ";
		ЭУ.Записать();
		
		ЦУ = ПланыОбмена.ИзмененныеОбъекты.НайтиПоКоду("000000002");
		Если ЦУ.Пустая() Тогда
			ЦУ = ПланыОбмена.ИзмененныеОбъекты.СоздатьУзел();
			ЦУ.Наименование = "ЦБ";
			ЦУ.Код = "000000002";
			ЦУ.Записать();
		КонецеСли;	
		
		Константы.УзелПланаОбмена.Установить(ЦУ.Ссылка);
		Константы.ТестоваяСреда.Установить(Истина);
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоЗабору);
	КонецеСли;	
	
		
	Заг = Константы.ЗаголовокСистемы.Получить();
	Если ЗначениеЗаполнено(Заг) Тогда
		Заголовок = "Сканирование (" + Константы.ЗаголовокСистемы.Получить() + ")";
	Иначе
		Заголовок = "Сканирование";
	КонецеСли;	
	
	ОсновнойСервер = Справочники.СерверыДанных.Сервер1.Ссылка;	
	Если Не ЗначениеЗаполнено(ОсновнойСервер.АдресWSDL) Или Не ЗначениеЗаполнено(ОсновнойСервер.АдресWSDLтест) Тогда
		Об = ОсновнойСервер.ПолучитьОбъект();
		Об.АдресWSDL = "http://188.138.57.232/Yandex_work/ws/Storage.1cws?wsdl";
		Об.АдресWSDLтест = "http://192.168.5.134/yasc/ws/Storage.1cws?wsdl";
		Об.Логин = "Admin";
		Об.Пароль = "losir7534qtg";
		Об.Записать();
	КонецеСли;
	
	СерверОбмена = Константы.СерверОбмена.Получить();
	Если СерверОбмена.Пустая() Тогда
		Константы.СерверОбмена.Установить(ОсновнойСервер.Ссылка);
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ОткрытьФормуМодально("ОбщаяФорма.ФормаАвторизации");
	Если Ответ <> "Ok" Тогда
		Отказ = Истина;
		Возврат;
	КонецеСли;	
	
	//#Если МобильноеПриложениеКлиент Тогда
	//НомерПриложения = "679786957300";
	//IDПодписчика = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений(НомерПриложения);
	//ДоставляемыеУведомления.ПодключитьОбработчикУведомлений("ПриПолученииУведомления");
	//#КонецЕсли

КонецПроцедуры
